---
kind: method
id: M:Autodesk.Revit.DB.FilterCategoryRule.AllCategoriesFilterable(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
source: html/e208c218-9ce0-a356-f909-b8b7dbea830f.htm
---
# Autodesk.Revit.DB.FilterCategoryRule.AllCategoriesFilterable Method

Checks that all of the given categories are filterable.

## Syntax (C#)
```csharp
public static bool AllCategoriesFilterable(
	ICollection<ElementId> categories
)
```

## Parameters
- **categories** (`System.Collections.Generic.ICollection < ElementId >`) - The set of categories to check.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null